---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.FunctionId
source: html/6b200dd5-4785-0858-ce95-7e40d8811d98.htm
---
# FunctionId Members

Retrieves data needed to serialize the target object.